平成31年春期 問81 ネットワーク

Webサイトを構築する際にスタイルシートを用いる理由として，適切なものはどれか。

ア　WebサーバとWebブラウザ間で安全にデータをやり取りできるようになる。
イ　Webサイトの更新情報を利用者に知らせることができるようになる。
ウ　Webサイトの利用者を識別できるようになる。
エ　複数のWebページの見た目を統一することが容易にできるようになる。

答え:エ:複数のwebページの見た目を統一することが容易にできるようになる.

平成31年春期 問87 セキュリティ

情報セキュリティ対策を，技術的対策，人的対策及び物理的対策の三つに分類したとき，物理的対策の例として適切なものはどれか。

ア　PCの不正使用を防止するために，PCのログイン認証にバイオメトリクス認証を導入する。
イ　サーバに対する外部ネットワークからの不正侵入を防止するために，ファイアウォールを設置する。
ウ　セキュリティ管理者の不正や作業誤りを防止したり発見したりするために，セキュリティ管理者を複数名にして，互いの作業内容を相互チェックする。
エ　セキュリティ区画を設けて施錠し，鍵の貸出し管理を行って不正な立入りがないかどうかをチェックする。 

答え:エ　セキュリティ区画を設けて施錠し，鍵の貸出し管理を行って不正な立入りがないかどうかをチェックする。

平成31年春期 問88 セキュリティ

ウイルスの感染に関する記述のうち，適切なものはどれか。

ア　OSやアプリケーションだけではなく，機器に組み込まれたファームウェアも感染することがある。
イ　PCをネットワークにつなげず，他のPCとのデータ授受に外部記憶媒体だけを利用すれば，感染することはない。
ウ　感染が判明したPCはネットワークにつなげたままにして，直ちにOSやセキュリティ対策ソフトのアップデート作業を実施する。
エ　電子メールの添付ファイルを開かなければ，感染することはない。

答え:ア: OSやアプリケーションだけではなく,機器に組み込まれたファームウェアも感染することがある.

平成31年春期 問42 プロジェクトマネジメント

プロジェクト管理におけるプロジェクトスコープの説明として，適切なものはどれか。

ア　プロジェクトチームの役割や責任
イ　プロジェクトで実施すべき作業
ウ　プロジェクトで実施する各作業の開始予定日と終了予定日
エ　プロジェクトを実施するために必要な費用

答:プロジェクトで実施すべき作業
 
平成31年春期 問43 サービスマネジメント・監査

内部統制の考え方に関する記述a〜dのうち，適切なものだけを全て挙げたものはどれか。

a　事業活動に関わる法律などを遵守し，社会規範に適合した事業活動を促進することが目的の一つである。
b　事業活動に関わる法律などを遵守することは目的の一つであるが，社会規範に適合した事業活動を促進することまでは求められていない。
c　内部統制の考え方は，上場企業以外にも有効であり取り組む必要がある。
d　内部統制の考え方は，上場企業だけに必要である。

ア　a，c
イ　a，d
ウ　b，c
エ　b，d

答: ア:a→事業活動に関わる法律などを遵守し，社会規範に適合した事業活動を促進することが目的の一つである,c→ 内部統制の考え方は，上場企業以外にも有効であり取り組む必要がある。


平成31年春期 問49 サービスマネジメント・監査

情報システムの施設や設備を維持・保全するファシリティマネジメントの施策として，適切なものはどれか。

ア　インターネットサイトへのアクセス制限
イ　コンピュータウイルスのチェック
ウ　スクリーンセーバの設定時間の標準化
エ　電力消費量のモニタリング

A.エ:電力消費量のモニタリング

平成31年春期 問40 プロジェクトマネジメント

情報システムを請負契約で海外ベンダに発注することになった。このときのプロジェクト調達マネジメントとして，適切な行動はどれか。

ア　受入れ後に不良が発見された場合には，契約にはなくても，該当の箇所だけでなく類似の不良箇所を調査して対策するよう指示する。
イ　海外ベンダの能力を生かすために，知的財産権の条項は契約に含めずプログラムを自由にコーディングさせる。
ウ　開発着手後に，開発範囲，仕様，作業内容などの調達内容を文書で合意する。
エ　契約時に，納品するドキュメントや開発中の仕様変更ルールなどを文書で合意する。

A.エ:契約時に,納品するドキュメントや開発中の仕様変更ルールなどを文章で合意する.

平成31年春期 問41 企業と法務

システムのテスト中に発見したバグを，原因別に集計して発生頻度の高い順に並べ，累積曲線を入れた図表はどれか。

ア　散布図
イ　特性要因図
ウ　パレート図
エ　ヒストグラム

答:パレード図

平成31年春期 問63 セキュリティ

PDCAモデルに基づいてISMSを運用している組織において，A（Act）で実施することの例として，適切なものはどれか。

ア　業務内容の監査結果に基づいた是正処置として，サーバの監視方法を変更する。
イ　サーバ管理者の業務内容を第三者が客観的に評価する。
ウ　サーバ室内の情報資産を洗い出す。
エ　サーバの動作を定められた運用手順に従って監視する。

A.ア　業務内容の監査結果に基づいた是正処置として，サーバの監視方法を変更する。

平成31年春期 問83 ネットワーク

PoEの説明として，適切なものはどれか。

ア　LANケーブルを使って電力供給する技術であり，電源コンセントがない場所に無線LANのアクセスポイントを設置する場合などで利用される。
イ　既設の電気配線を利用してLANを構築できる技術であり，新たにLANケーブルを敷設しなくてもよい。
ウ　グローバルアドレスとプライベートアドレスを自動的に変換して転送する技術であり，社内LANとインターネットとの境界部で使われる。
エ　通信速度や通信モードを自動判別する技術であり，異なるイーサネット規格が混在しているLAN環境で，ネットワーク機器の最適な通信設定を自動的に行える。

A. ア　LANケーブルを使って電力供給する技術であり，電源コンセントがない場所に無線LANのアクセスポイントを設置する場合などで利用される。

平成31年春期 問93 ネットワーク

NFCに準拠した無線通信方式を利用したものはどれか。

ア　ETC車載器との無線通信
イ　エアコンのリモートコントロール
ウ　カーナビの位置計測
エ　交通系のIC乗車券による改札

A.エ　交通系のIC乗車券による改札