令和元年秋期 問8 経営戦略

人口減少や高齢化などを背景に，ICTを活用して，都市や地域の機能やサービスを効率化，高度化し，地域課題の解決や活性化を実現することが試みられている。このような街づくりのソリューションを示す言葉として，最も適切なものはどれか。

ア　キャパシティ
イ　スマートシティ
ウ　ダイバーシティ
エ　ユニバーシティ

答え:スマートシティ

令和元年秋期 問15 経営戦略

自社の商品やサービスの情報を主体的に収集する見込み客の獲得を目的に，企業がSNSやブログ，検索エンジンなどを利用して商品やサービスに関連する情報を発信する。このようにして獲得した見込み客を，最終的に顧客に転換させることを目標とするマーケティング手法として，最も適切なものはどれか。

ア　アウトバウンドマーケティング
イ　インバウンドマーケティング
ウ　ダイレクトマーケティング
エ　テレマーケティング

答え：インバウンドマーケティング

令和元年秋期 問22 経営戦略

人工知能の活用事例として，最も適切なものはどれか。

ア　運転手が関与せずに，自動車の加速，操縦，制動の全てをシステムが行う。
イ　オフィスの自席にいながら，会議室やトイレの空き状況がリアルタイムに分かる。
ウ　銀行のような中央管理者を置かなくても，分散型の合意形成技術によって，取引の承認を行う。
エ　自宅のPCから事前に入力し，窓口に行かなくても自動で振替や振込を行う。

答え：ア　運転手が関与せずに，自動車の加速，操縦，制動の全てをシステムが行う。

令和元年秋期 問26 企業と法務

製品Aの生産計画量，部品Bの総所要量及び在庫量が表のとおりであるとき，第2週における部品Bの発注量aは何個か。

〔条件〕
・製品Aの生産リードタイム（着手から完成までの期間）は無視する。
・製品Aを1個生産するためには部品Bが2個必要であり，部品Bは製品Aの生産以外には使われない。
・部品Bの発注は，各週の生産終了後に行い，翌週の生産開始までに入荷する。
・部品Bの安全在庫は，当該週の部品Bの総所要量の25％とする。
・部品Bの第1週の生産開始前の在庫量を100個とする。

￼
注記　網掛けの部分は表示していない。

ア　30
イ　40
ウ　60
エ　80

A.ア-> 30

令和元年秋期 問27 企業と法務

取得した個人情報の管理に関する行為a〜cのうち，個人情報保護法において，本人に通知又は公表が必要となるものだけを全て挙げたものはどれか。

　a　個人情報の入力業務の委託先の変更
　b　個人情報の利用目的の合理的な範囲での変更
　c　利用しなくなった個人情報の削除

ア　a
イ　a，b
ウ　b
エ　b，c

A.個人情報の利用目的の合理的な範囲での変更

令和元年秋期 問31 システム戦略

RFIDの活用によって可能となる事柄として，適切なものはどれか。

ア　移動しているタクシーの現在位置をリアルタイムで把握する。
イ　インターネット販売などで情報を暗号化して通信の安全性を確保する。
ウ　入館時に指紋や虹彩といった身体的特徴を識別して個人を認証する。
エ　本の貸出時や返却の際に複数の本を一度にまとめて処理する。

A.エ　本の貸出時や返却の際に複数の本を一度にまとめて処理する。

令和元年秋期 問32 経営戦略

一般消費者向けの製品を製造しているA社では，新製品の開発に当たって，市場を取り巻くマクロ環境を政治，経済，社会，技術の観点について分析することにした。このときに収集すべき情報として，最も適切なものはどれか。

ア　競合企業の経営戦略
イ　競合企業の財務状況
ウ　主要仕入先の原材料価格
エ　我が国の高齢化率

A.エ　我が国の高齢化率
令和元年秋期 問43 サービスマネジメント・監査

AIを利用したチャットボットに関する事例として，最も適切なものはどれか。

ア　あらゆる物がインターネットを介してつながることによって，外出先でスマートデバイスから自宅のエアコンのスイッチを入れることなどができるようになる。
イ　コンピュータが様々な動物の画像を大量に認識して学習することによって，犬と猫の画像が判別できるようになる。
ウ　商品の操作方法などの質問を書き込むと，詳しい知識をもった人が回答や助言を投稿してくれる。
エ　商品の販売サイトで，利用者が求める商品の機能などを入力すると，その内容に応じて推奨する商品をコンピュータが会話型で紹介してくれる。

A.エ　商品の販売サイトで，利用者が求める商品の機能などを入力すると，その内容に応じて推奨する商品をコンピュータが会話型で紹介してくれる。


令和元年秋期 問44 サービスマネジメント・監査

業務処理時間の短縮を目的として，運用中の業務システムの処理能力の改善を図った。この改善が有効であることを評価するためにシステム監査を実施するとき，システム監査人が運用部門に要求する情報として，適切なものはどれか。

ア　稼働統計資料
イ　システム運用体制
ウ　システム運用マニュアル
エ　ユーザマニュアル

A.稼働統計資料

令和元年秋期 問48 サービスマネジメント・監査

サービスレベル管理のPDCAサイクルのうち，C（Check）で実施する内容はどれか。

ア　SLAに基づくサービスを提供する。
イ　サービス提供結果の報告とレビューに基づき，サービスの改善計画を作成する。
ウ　サービス要件及びサービス改善計画を基に，目標とするサービス品質を合意し，SLAを作成する。
エ　提供したサービスを監視・測定し，サービス報告書を作成する。

A.提供したサービスを監視・測定し，サービス報告書を作成する。

令和元年秋期 問58 コンピュータシステム

PCの周辺装置を利用可能にするためのデバイスドライバに関する記述のうち，適切なものはどれか。

ア　HDDを初期化してOSを再インストールした場合，OSとは別にインストールしていたデバイスドライバは再インストールする必要がある。
イ　新しいアプリケーションソフトウェアをインストールした場合，そのソフトウェアが使用する全てのデバイスドライバを再インストールする必要がある。
ウ　不要になったデバイスドライバであっても，一度インストールしたデバイスドライバを利用者が削除することはできない。
エ　プリンタのデバイスドライバを一つだけインストールしていれば，メーカや機種を問わず全てのプリンタが使用できる。
　
A.ア　HDDを初期化してOSを再インストールした場合，OSとは別にインストールしていたデバイスドライバは再インストールする必要がある。

令和元年秋期 問66 データベース

関係データベースにおいて，主キーを設定する理由はどれか。

ア　算術演算の対象とならないことが明確になる。
イ　主キーを設定した列が検索できるようになる。
ウ　他の表からの参照を防止できるようになる。
エ　表中のレコードを一意に識別できるようになる。

A.表中のレコードを一意に識別できるようになる　


令和元年秋期 問68 セキュリティ

1年前に作成した情報セキュリティポリシについて，適切に運用されていることを確認するための監査を行った。この活動はPDCAサイクルのどれに該当するか。

ア　P
イ　D
ウ　C
エ　A

A.ウ(C→check)

令和元年秋期 問70 基礎理論

大文字の英字から成る文字列の暗号化を考える。暗号化の手順と例は次のとおりである。この手順で暗号化した結果が“EGE”であるとき，元の文字列はどれか。

￼
￼

ア　BED
イ　DEB
ウ　FIH
エ　HIF


A.DEB

令和元年秋期 問73 セキュリティ

IoT機器やPCに保管されているデータを暗号化するためのセキュリティチップであり，暗号化に利用する鍵などの情報をチップの内部に記憶しており，外部から内部の情報の取出しが困難な構造をもつものはどれか。

ア　GPU
イ　NFC
ウ　TLS
エ　TPM


A.TPM

令和元年秋期 問75 コンピュータシステム

アクティビティトラッカの説明として，適切なものはどれか。

ア　PCやタブレットなどのハードウェアのROMに組み込まれたソフトウェア
イ　一定期間は無料で使用できるが，継続して使用する場合は，著作権者が金品などの対価を求めるソフトウェアの配布形態の一つ，又はそのソフトウェア
ウ　ソーシャルメディアで提供される，友人や知人の活動状況や更新履歴を配信する機能
エ　歩数や運動時間，睡眠時間などを，搭載された各種センサによって計測するウェアラブル機器

A.歩数や運動時間，睡眠時間などを，搭載された各種センサによって計測するウェアラブル機器

令和元年秋期 問78 セキュリティ

部外秘とすべき電子ファイルがある。このファイルの機密性を確保するために使用するセキュリティ対策技術として，適切なものはどれか。

ア　アクセス制御
イ　タイムスタンプ
ウ　ディジタル署名
エ　ホットスタンバイ

A.アクセス制御

令和元年秋期 問79 ネットワーク

Aさんが，Pさん，Qさん及びRさんの3人に電子メールを送信した。Toの欄にはPさんのメールアドレスを，Ccの欄にはQさんのメールアドレスを，Bccの欄にはRさんのメールアドレスをそれぞれ指定した。電子メールを受け取ったPさん，Qさん及びRさんのうち，同じ内容の電子メールがPさん，Qさん及びRさんの3人に送られていることを知ることができる人だけを全て挙げたものはどれか。

ア　Pさん，Qさん，Rさん
イ　Pさん，Rさん
ウ　Qさん，Rさん
エ　Rさん

A.Rさん

令和元年秋期 問86 セキュリティ

情報セキュリティのリスクマネジメントにおけるリスク対応を，リスクの移転，回避，受容及び低減の四つに分類するとき，リスクの低減の例として，適切なものはどれか。

ア　インターネット上で，特定利用者に対して，機密に属する情報の提供サービスを行っていたが，情報漏えいのリスクを考慮して，そのサービスから撤退する。
イ　個人情報が漏えいした場合に備えて，保険に加入する。
ウ　サーバ室には限られた管理者しか入室できず，機器盗難のリスクは低いので，追加の対策は行わない。
エ　ノートPCの紛失，盗難による情報漏えいに備えて，ノートPCのHDDに保存する情報を暗号化する。

A.ノートPCの紛失，盗難による情報漏えいに備えて，ノートPCのHDDに保存する情報を暗号化する。る.

令和元年秋期 問92 ネットワーク

外部と通信するメールサーバをDMZに設置する理由として，適切なものはどれか。

ア　機密ファイルが添付された電子メールが，外部に送信されるのを防ぐため
イ　社員が外部の取引先へ送信する際に電子メールの暗号化を行うため
ウ　メーリングリストのメンバのメールアドレスが外部に漏れないようにするため
エ　メールサーバを踏み台にして，外部から社内ネットワークに侵入させないため

答え:エ　メールサーバを踏み台にして，外部から社内ネットワークに侵入させないため


令和元年秋期 問96 コンピュータシステム

販売管理システムに関する記述のうち，TCOに含まれる費用だけを全て挙げたものはどれか。
 
　①　販売管理システムで扱う商品の仕入高
　②　販売管理システムで扱う商品の配送費
　③　販売管理システムのソフトウェア保守費
　④　販売管理システムのハードウェア保守費

ア　①，②
イ　①，④
ウ　②，③
エ　③，④

答え：エ:3.販売管理システムのソフトウェア保守費4.販売管理システムのハードウェア保守費


令和元年秋期 問97 セキュリティ

情報セキュリティの三大要素である機密性，完全性及び可用性に関する記述のうち，最も適切なものはどれか。

ア　可用性を確保することは，利用者が不用意に情報漏えいをしてしまうリスクを下げることになる。
イ　完全性を確保する方法の例として，システムや設備を二重化して利用者がいつでも利用できるような環境を維持することがある。
ウ　機密性と可用性は互いに反する側面をもっているので，実際の運用では両者をバランスよく確保することが求められる。
エ　機密性を確保する方法の例として，データの滅失を防ぐためのバックアップや誤入力を防ぐための入力チェックがある。
　答え：ウ　機密性と可用性は互いに反する側面をもっているので，実際の運用では両者をバランスよく確保することが求められる。


令和元年秋期 問99 基礎理論

ワイルドカードに関する次の記述中のa，bに入れる字句の適切な組合せはどれか。

　任意の1文字を表す“?”と，長さゼロ以上の任意の文字列を表す“*”を使った文字列の検索について考える。   a   では，“データ”を含む全ての文字列が該当する。また，   b   では，データ”で終わる全ての文字列が該当する。

￼
答え:エ　a:*データ*,b:*データ


