令和02年秋期 問8 システム戦略

電力会社において，人による検針の代わりに，インターネットに接続された電力メータと通信することで，各家庭の電力使用量を遠隔計測するといったことが行われている。この事例のように，様々な機器をインターネットに接続して情報を活用する仕組みを表す用語はどれか。

ア　EDI
イ　IoT
ウ　ISP　
エ　RFID

A.IoT

令和02年秋期 問10 システム戦略

IoTに関する事例として，最も適切なものはどれか。

ア　インターネット上に自分のプロファイルを公開し，コミュニケーションの輪を広げる。
イ　インターネット上の店舗や通信販売のWebサイトにおいて，ある商品を検索すると，類似商品の広告が表示される。
ウ　学校などにおける授業や講義をあらかじめ録画し，インターネットで配信する。
エ　発電設備の運転状況をインターネット経由で遠隔監視し，発電設備の性能管理，不具合の予兆検知及び補修対応に役立てる。

A.エ　発電設備の運転状況をインターネット経由で遠隔監視し，発電設備の性能管理，不具合の予兆検知及び補修対応に役立てる。

令和02年秋期 問25 企業と法務

サイバーセキュリティ基本法は，サイバーセキュリティに関する施策に関し，基本理念を定め，国や地方公共団体の責務などを定めた法律である。記述a〜dのうち，この法律が国の基本的施策として定めているものだけを全て挙げたものはどれか。

　a　国の行政機関等におけるサイバーセキュリティの確保
　b　サイバーセキュリティ関連産業の振興及び国際競争力の強化
　c　サイバーセキュリティ関連犯罪の取締り及び被害の拡大の防止
　d　サイバーセキュリティに係る人材の確保

ア　a
イ　a，b
ウ　a，b，c
エ　a，b，c，d

A.　	a　国の行政機関等におけるサイバーセキュリティの確保
　	b　サイバーセキュリティ関連産業の振興及び国際競争力の強化
　	c　サイバーセキュリティ関連犯罪の取締り及び被害の拡大の防止
　	d　サイバーセキュリティに係る人材の確保

令和02年秋期 問37 開発技術

開発対象のソフトウェアを，比較的短い期間で開発できる小さな機能の単位に分割しておき，各機能の開発が終了するたびにそれをリリースすることを繰り返すことで，ソフトウェアを完成させる。一つの機能の開発終了時に，次の開発対象とする機能の優先順位や内容を見直すことで，ビジネス環境の変化や利用者からの要望に対して，迅速に対応できることに主眼を置く開発手法はどれか。

ア　アジャイル
イ　ウォータフォール
ウ　構造化
エ　リバースエンジニアリング

A.アジャイル
令和02年秋期 問40 プロジェクトマネジメント

プロジェクトマネジメントの活動には，プロジェクト統合マネジメント，プロジェクトスコープマネジメント，プロジェクトスケジュールマネジメント，プロジェクトコストマネジメントなどがある。プロジェクト統合マネジメントの活動には，資源配分を決め，競合する目標や代替案間のトレードオフを調整することが含まれる。システム開発プロジェクトにおいて，当初の計画にない機能の追加を行う場合のプロジェクト統合マネジメントの活動として，適切なものはどれか。

ア　機能追加に掛かる費用を見積もり，必要な予算を確保する。
イ　機能追加に対応するために，納期を変更するか要員を追加するかを検討する。
ウ　機能追加のために必要な作業や成果物を明確にし，WBSを更新する。
エ　機能追加のための所要期間を見積もり，スケジュールを変更する。

A.イ 機能追加に対応するために,納期を変更するか要員を追加するか検討する.

令和02年秋期 問47 サービスマネジメント・監査

システム障害が発生した際，インシデント管理を担当するサービスデスクの役割として，適切なものはどれか。

ア　既知の障害事象とその回避策の利用者への紹介
イ　システム障害対応後の利用者への教育
ウ　障害が発生している業務の代行処理
エ　障害の根本原因調査

A.既知の障害事象とその回避策の利用者への紹介

令和02年秋期 問55 プロジェクトマネジメント

図の工程の最短所要日数及び最長所要日数は何日か。

￼



A.最短所要日数:80日,最長所要日数:100日

令和02年秋期 問72 データベース

2台のPCから一つのファイルを並行して更新した。ファイル中のデータnに対する処理が①～④の順に行われたとき，データnは最後にどの値になるか。ここで，データnの初期値は10であった。

￼


ア　5
イ　10
ウ　12
エ　17

A.10

令和02年秋期 問74 基礎理論

IoTデバイスへの電力供給でも用いられ，周りの環境から光や熱（温度差）などの微小なエネルギーを集めて，電力に変換する技術はどれか。

ア　PLC
イ　PoE
ウ　エネルギーハーベスティング
エ　スマートグリッド


A.エネルギーハーベスティング

令和02年秋期 問80 基礎理論

HyperTextの特徴を説明したものはどれか。

ア　いろいろな数式を作成・編集できる機能をもっている。
イ　いろいろな図形を作成・編集できる機能をもっている。
ウ　多様なテンプレートが用意されており，それらを利用できるようにしている。
エ　文中の任意の場所にリンクを埋め込むことで関連した情報をたどれるようにした仕組みをもっている。

A.エ　文中の任意の場所にリンクを埋め込むことで関連した情報をたどれるようにした仕組みをもっている。

令和02年秋期 問86 セキュリティ

二要素認証の説明として，最も適切なものはどれか。

ア　所有物，記憶及び生体情報の3種類のうちの2種類を使用して認証する方式
イ　人間の生体器官や筆跡などを使った認証で，認証情報の2か所以上の特徴点を使用して認証する方式
ウ　文字，数字及び記号のうち2種類以上を組み合わせたパスワードを用いて利用者を認証する方式
エ　利用者を一度認証することで二つ以上のシステムやサービスなどを利用できるようにする方式

A.ア　所有物，記憶及び生体情報の3種類のうちの2種類を使用して認証する方式


令和02年秋期 問89 セキュリティ

PDCAモデルに基づいてISMSを運用している組織の活動において，PDCAモデルのA（Act）に相当するプロセスで実施するものとして，適切なものはどれか。

ア　運用状況の監視や運用結果の測定及び評価で明らかになった不備などについて，見直しと改善策を決定する。
イ　運用状況の監視や運用結果の測定及び評価を行う。
ウ　セキュリティポリシの策定や組織内の体制の確立，セキュリティポリシで定めた目標を達成するための手順を策定する。
エ　セキュリティポリシの周知徹底やセキュリティ装置の導入などを行い，具体的に運用する。

A.ア　運用状況の監視や運用結果の測定及び評価で明らかになった不備などについて，見直しと改善策を決定する。


令和02年秋期 問99 コンピュータシステム

IoTデバイスとIoTサーバで構成され，IoTデバイスが計測した外気温をIoTサーバへ送り，IoTサーバからの指示でIoTデバイスに搭載されたモータが窓を開閉するシステムがある。このシステムにおけるアクチュエータの役割として，適切なものはどれか。

ア　IoTデバイスから送られてくる外気温のデータを受信する。
イ　IoTデバイスに対して窓の開閉指示を送信する。
ウ　外気温を電気信号に変換する。
エ　窓を開閉する。

A.窓を開閉する.