平成30年春期 問8 企業と法務

企業におけるマイナンバーの取扱いに関する行為a〜cのうち，マイナンバー法に照らして適切なものだけを全て挙げたものはどれか。

　a　従業員から提供を受けたマイナンバーを人事評価情報の管理番号として利用する。
　b　従業員から提供を受けたマイナンバーを税務署に提出する調書に記載する。
　c　従業員からマイナンバーの提供を受けるときに，その番号が本人のものであることを確認する。

ア　a，b
イ　a，b，c
ウ　b
エ　b，c

A.従業員から提供を受けたマイナンバーを税務署に提出する調整に記載する.
平成30年春期 問15 企業と法務

1個の製品Pは2個の部品Qで構成され，部品Qは4個の部品Rで構成されている。部品Qは1個，部品Rは3個の在庫があるとき，製品Pを6個生産するには，部品Rはあと何個必要か。

ア　41
イ　44
ウ　45
エ　48

A.44

平成30年春期 問20 企業と法務

ブレーンストーミングの進め方のうち，適切なものはどれか。

ア　自由奔放なアイディアは控え，実現可能なアイディアの提出を求める。
イ　他のメンバの案に便乗した改善案が出ても，とがめずに進める。
ウ　メンバから出される意見の中で，テーマに適したものを選択しながら進める。
エ　量よりも質の高いアイディアを追求するために，アイディアの批判を奨励する。

A.メンバから出される意見の中で,テーマに適したものを選択しながら進める.

平成30年春期 問26 企業と法務

法律a〜cのうち，内部統制の整備を要請しているものだけを全て挙げたものはどれか。

　a　会社法
　b　金融商品取引法
　c　労働者派遣法

ア　a，b
イ　a，b，c
ウ　a，c
エ　b

A.会社法,金融商品取引法,労働者派遣法

平成30年春期 問29 経営戦略

航空会社A社では，経営戦略を実現するために，バランススコアカードの四つの視点ごとに戦略目標を設定した。bに該当するものはどれか。ここで，a〜dはア〜エのどれかに対応するものとする。

￼

ア　学習と成長の視点
イ　業務プロセスの視点
ウ　顧客の視点
エ　財務の視点

A.学習と成長視点　
