D：
九州電力が行なっている取り組み(SDG)

九州電力
電気ガスなどの事業.
作る責任,目標達成をしよう
KPI
CO2排出削減量

再エネ発電:
7番:再エネや原子力の活用などを通じた電源の低.脱炭素化

新しい再エネ発電
風力発電

設備などの管理における環境への配慮
社有林の適正管理
大分県を中止とした樹木林を維持管理している

環境アセスメントも実施

とりくみ

1.環境保全活動
2.環境エネルギー教育

下調べがとても進んでいる
E:

提案型
作る責任と使う
課題個人でできることが何か知らない
大学内で取り組めることが大切
エシカル消費
環境を考えた消費を購入することで課題に取り組む事業者を応援しながら消費活動をすること
目標12

セブンの5%還元を購入する
手前とりを行う

C
SDGsに貢献する「ものづくり」


B:SDGs:時速可能な開発目標の略語
脱炭素社会 

自分達が関わっている企業などがSDGsに関わっていることがわかった.

SDGsを知らない人たちに対してわかりやすくまとめられて,
自分達が普段利用している施設を例にSDGsの在り方などをまとめられている

